freight_train_CFD/simulation/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;



boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    frontAndBack
    {
        type            calculated;
        value           uniform 0;
    }
   
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    lowerWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    upperWall
    {
        type            calculated;
        value           uniform 0;
    }
    
    Back
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    Upper
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    Front
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
 Lower 
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    train
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
